{"name":"Overlord's New Mansion analytics","short_name":"ONM analytics","description":"This project was an analytics visualizer for Overlord's new mansion, the anonymous data was collected through itch.io playthroughs via the firebase realtime DB API. \n\nThe purpose of this project was to help me design better levels for the game, and it did help me a lot. One non-abvious concept in game development is that devs eventually get \"too good\" at their own game after each testing iteration, so much so that you can't help it but 'de-emphatize' to the first time players complains about game difficulty. \n\nBecause of this, for a week or two I started collecting anonymous data. Each user session has the following data: timestamp, death count, device(mobile or pc), rentention, max level reached, and deaths: an array containing all the records of the players deaths, with x,y coordinates and the level id. Then, since looking at the database would be pretty useless, I made this application to read the data on the database, and for each player session, on each level, display a red circle over the deaths. If there are too many circles close to the same spot, it meant that I had to redesign that part of the level. In some cases, there are visibile 'rage-quits', when in a level there are a lot of death records, and the following levels have no records, it most likely meant that the player left the game, as example in the case of player #5 in level #7: I was able to immediately tell that the player didn't get to solve the puzzle of propelling itself from the bouncy ball, and instead tried to just jump the gap. That part is still there and probably confuses many players... but at least I can tell it does. Many other levels were partially reworked thanks to this tool.","instructions":"Buttons at the top of the page represents the level, buttons on the right represents an anonymous user playthrough session. Scroll vertically/horizontally or zoom out if you are not able to view parts of the game map.","thumbnail":"./thumbnail.png","start_url":"./index.html","width":"800","height":"600","links":[],"resources":[],"creation_date":"2019-05-27","desktop":true,"mobile":false}